Repository: SmaRTy-Saini/DepHealth
Catalog: locale/*/LC_MESSAGES/dep_health.po
Languages: fr

source: Warning:
fr: Avertissement :

source: Error:
fr: Erreur :

source: Dependency Health Report
fr: Rapport de santé des dépendances

source: Scan Date: %Y-%m-%d %H:%M:%S
fr: Date du scan : %Y-%m-%d %H:%M:%S

source: Project Type: %s
fr: Type de projet : %s

source: Health Score: %s/100
fr: Score de santé : %s/100

source: Dependencies:
fr: Dépendances :

source: No known issues
fr: Aucun problème connu

source: Vulnerable:
fr: Vulnérable :

source: Severity:
fr: Gravité :

source: (Fix available)
fr: (Correctif disponible)

source: Fix %s:
fr: Corriger %s :

source: Update %s:
fr: Mettre à jour %s :

source: for latest features and security patches.
fr: pour les dernières fonctionnalités et correctifs de sécurité.

source: No immediate actions recommended. Your dependencies look healthy!
fr: Aucune action immédiate recommandée. Vos dépendances sont saines !

source: To save this report, use: `python dep_health.py scan --output report.json`
fr: Pour enregistrer ce rapport, utilisez : `python dep_health.py scan --output report.json`

source: For more options, run: `python dep_health.py --help`
fr: Pour plus d'options, exécutez : `python dep_health.py --help`

source: Fetching latest versions
fr: Récupération des dernières versions

source: pkg
fr: paquet

source: Could not determine latest version from GitHub releases.
fr: Impossible de déterminer la dernière version des versions GitHub.

source: You are running the latest version: v%s
fr: Vous utilisez la dernière version : v%s

source: A new version is available: %s (Current: v%s)
fr: Une nouvelle version est disponible : %s (Actuel : v%s)

source: Please update your tool by running:
fr: Veuillez mettre à jour votre outil en exécutant :

source: Or download from: %s
fr: Ou télécharger depuis : %s

source: Scanning dependencies for %s project...
fr: Analyse des dépendances pour le projet %s...

source: 'npm' command not found. Please ensure Node.js and npm are installed and in your system's PATH.
fr: Commande 'npm' introuvable. Veuillez vous assurer que Node.js et npm sont installés et dans votre PATH.

source: 'pip-audit' command not found. Install it with 'pip install pip-audit' and ensure it's in your PATH.
fr: Commande 'pip-audit' introuvable. Installez-la avec 'pip install pip-audit' et assurez-vous qu'elle est dans votre PATH.

source: 'composer' command not found. Please ensure Composer is installed and in your PATH.
fr: Commande 'composer' introuvable. Veuillez vous assurer que Composer est installé et dans votre PATH.

source: No recognized project file found (e.g., 'package.json', 'requirements.txt', 'composer.json') in the current directory.
fr: Aucun fichier de projet reconnu trouvé (par exemple, 'package.json', 'requirements.txt', 'composer.json') dans le répertoire actuel.

source: Error: '--repo-owner' and '--repo-name' are required for GitHub integration, or set them in config.ini.
fr: Erreur : '--repo-owner' et '--repo-name' sont requis pour l'intégration GitHub, ou configurez-les dans config.ini.

source: Error: GitHub Personal Access Token (GITHUB_TOKEN) not found. Set it as an environment variable or in config.ini.
fr: Erreur : Jeton d'accès personnel GitHub (GITHUB_TOKEN) introuvable. Définissez-le comme variable d'environnement ou dans config.ini.

source: Successfully created GitHub issue: %s
fr: Problème GitHub créé avec succès : %s

source: Network connection problem while trying to reach GitHub API. Check your internet connection.
fr: Problème de connexion réseau lors de la tentative d'accès à l'API GitHub. Vérifiez votre connexion Internet.

source: Request to GitHub API timed out. The server might be busy or your connection is slow.
fr: La requête à l'API GitHub a expiré. Le serveur est peut-être occupé ou votre connexion est lente.

source: Repository not found or incorrect owner/name. Please check --repo-owner and --repo-name.
fr: Dépôt introuvable ou propriétaire/nom incorrect. Veuillez vérifier --repo-owner et --repo-name.

source: Unauthorized. Please check if your GITHUB_TOKEN is valid and has 'repo' scope.
fr: Non autorisé. Veuillez vérifier si votre GITHUB_TOKEN est valide et possède la portée 'repo'.

source: Forbidden. Likely API rate limit or insufficient permissions. %s
fr: Interdit. Probablement une limite de débit de l'API ou des autorisations insuffisantes. %s

source: An unexpected error occurred while creating GitHub issue: %s
fr: Une erreur inattendue est survenue lors de la création du problème GitHub : %s

source: No specific details provided by audit.
fr: Aucun détail spécifique fourni par l'audit.

source: No known vulnerabilities.
fr: Aucune vulnérabilité connue.

source: Up-to-date
fr: À jour

source: Vulnerable
fr: Vulnérable

source: Outdated
fr: Obsolète

source: dependency health
fr: santé des dépendances

source: Generated Health Badge URL:
fr: URL du badge de santé généré :

source: Generated Health Badge Markdown (for README):
fr: Markdown du badge de santé généré (pour README) :

source: Checking for tool updates...
fr: Vérification des mises à jour de l'outil...

source: An unexpected error occurred during update check: %s
fr: Une erreur inattendue est survenue lors de la vérification des mises à jour : %s

source: Could not check for updates (network or API error): %s
fr: Impossible de vérifier les mises à jour (erreur réseau ou API) : %s

source: Scan failed: %s
fr: Échec du scan : %s

source: An unexpected fatal error occurred during scan: %s
fr: Une erreur fatale inattendue est survenue lors du scan : %s

source: Available commands
fr: Commandes disponibles

source: Scan your project's dependencies for health.
fr: Scannez les dépendances de votre projet pour leur santé.

source: Optional: Path to save the report as a JSON file (e.g., 'report.json').
fr: Optionnel : Chemin pour enregistrer le rapport en tant que fichier JSON (par exemple, 'report.json').

source: Optional: Create a GitHub issue with the report. Requires GITHUB_TOKEN env var or config.ini, --repo-owner, and --repo-name.
fr: Optionnel : Créer un problème GitHub avec le rapport. Nécessite la variable d'environnement GITHUB_TOKEN ou config.ini, --repo-owner et --repo-name.

source: GitHub repository owner (e.g., 'octocat'). Can also be set in config.ini.
fr: Propriétaire du dépôt GitHub (par exemple, 'octocat'). Peut également être défini dans config.ini.

source: GitHub repository name (e.g., 'Spoon-Knife'). Can also be set in config.ini.
fr: Nom du dépôt GitHub (par exemple, 'Spoon-Knife'). Peut également être défini dans config.ini.

source: Optional: Only scan production dependencies (skip 'devDependencies' for Node.js, 'require-dev' for PHP).
fr: Optionnel : Ne scanner que les dépendances de production (ignorer les 'devDependencies' pour Node.js, 'require-dev' pour PHP).

source: Optional: Comma-separated list of package names to ignore from scan and vulnerability checks (e.g., 'package-a,package-b').
fr: Optionnel : Liste de noms de paquets séparés par des virgules à ignorer du scan et des vérifications de vulnérabilité (par exemple, 'paquet-a,paquet-b').

source: Optional: Suppress most terminal output, only show final report or errors.
fr: Optionnel : Supprimer la plupart des sorties du terminal, n'afficher que le rapport final ou les erreurs.

source: Optional: Output only the JSON report to stdout, suppressing all other terminal output. Ideal for CI/CD piping.
fr: Optionnel : N'afficher que le rapport JSON sur stdout, en supprimant toutes les autres sorties du terminal. Idéal pour le chaînage CI/CD.

source: Optional: Generate a health score badge URL and Markdown for your README.
fr: Optionnel : Générer une URL de badge de score de santé et un Markdown pour votre README.

source: Check if a new version of the Dependency Health Dashboard CLI tool is available.
fr: Vérifiez si une nouvelle version de l'outil CLI Dependency Health Dashboard est disponible.

source: Connects to the GitHub repository to see if a newer release of the tool exists.
fr: Se connecte au dépôt GitHub pour voir si une nouvelle version de l'outil existe.

source: Optional: Suppress most terminal output for update check.
fr: Optionnel : Supprimer la plupart des sorties du terminal pour la vérification des mises à jour.

source: 'npm audit' returned no output. Is npm installed and configured correctly in your project?
fr: 'npm audit' n'a renvoyé aucune sortie. npm est-il installé et configuré correctement dans votre projet ?

source: 'pip-audit' returned no output. Are dependencies installed in a virtual environment?
fr: 'pip-audit' n'a renvoyé aucune sortie. Les dépendances sont-elles installées dans un environnement virtuel ?

source: 'composer audit' returned no output. Are dependencies installed?
fr: 'composer audit' n'a renvoyé aucune sortie. Les dépendances sont-elles installées ?

source: No version fetcher for ecosystem: %s. Skipping version checks.
fr: Aucun récupérateur de version pour l'écosystème : %s. Saut de la vérification des versions.

source: Could not parse version for '%s' (%s vs %s): %s. Using simple comparison.
fr: Impossible d'analyser la version pour '%s' (%s vs %s) : %s. Utilisation d'une comparaison simple.

source: Packaging library not found for accurate semantic versioning. Using simple comparison for '%s'.
fr: Bibliothèque de 'packaging' introuvable pour une gestion sémantique précise des versions. Utilisation d'une comparaison simple pour '%s'.

source: Error creating GitHub issue (HTTP %s): %s
fr: Erreur lors de la création du problème GitHub (HTTP %s) : %s

source: Attempting to create GitHub issue in %s/%s...
fr: Tentative de création d'un problème GitHub dans %s/%s...

source: Warning: Could not load translations for '%s'. Defaulting to English. Ensure 'locale/%s/LC_MESSAGES/dep_health.mo' exists.
fr: Avertissement : Impossible de charger les traductions pour '%s'. Reversion à l'anglais. Assurez-vous que 'locale/%s/LC_MESSAGES/dep_health.mo' existe.
